# Задача 2: Найдите сумму цифр трехзначного числа.

a = int(input('Введите трехзначное число: '))
if 99 < a < 1000:
    print(f'{a} -> {a//100+a%100//10+a%10} ({a//100} + {a%100//10} + {a%10})')
else:
    print('Вы ввели не трехзначное число')

# *Пример*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)
print('------------------------------------')

# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов.
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое
# количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

S = int(input('Введите количество журавликов: '))

if S % 6 == 0:
    print(
        f'{S} -> {S//6} {S//6*4} {S//6}')

# *Пример:*
# 6 -> 1  4  1
# 24 -> 4  16  4
# 60 -> 10  40  10
print('------------------------------------')

# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали
# билет с номером. Счастливым билетом называют такой билет с шестизначным номером, где сумма первых
# трех цифр равна сумме последних трех. Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам
# требуется написать программу, которая проверяет счастливость билета.


def sum(a):
    return a//100+a % 100//10+a % 10


N = int(input('Введите номер билета: '))
if sum(N//1000) == sum(N % 1000):
    print(f'{N} -> yes')
else:
    print(f'{N} -> no')

# *Пример:*
# 385916 -> yes
# 123456 -> no
print('------------------------------------')

# Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, если
# разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).

n = int(input('Введите длину шоколадки(в дольках): '))
m = int(input('Введите ширину шоколадки(в дольках): '))
k = int(input('Сколько долек нужно отломить: '))

if k < n * m and ((k % n == 0) or (k % m == 0)):
    print(f'{n} {m} {k} -> yes')
else:
    print(f'{n} {m} {k} -> no')

# *Пример:*
# 3 2 4 -> yes
# 3 2 1 -> no
